cnlohr/lolra/ch32v/ch32v203-goertzel/adcgoertzel.c
				// Try to improve bias.
				adc_offset -= accumulate_over_window / g_goertzel_buffer;
				accumulate_over_window = 0;

#ifdef PROFILING_PIN
	funDigitalWrite( PROFILING_PIN, 1 );
#endif

			}
		}

		intfr = DMA1->INTFR;
	} while( intfr & DMA1_IT_GL1 );

	g_goertzelp2 = goertzelp2;
	g_goertzelp = goertzelp;
	g_goertzel = goertzel;
	g_goertzel_samples = goertzel_samples;
	g_accumulate_over_window = accumulate_over_window;

#ifdef PROFILING_PIN
	funDigitalWrite( PROFILING_PIN, 0 ); // For profiling
#endif
	int32_t end = SysTick->CNT;
	g_lastper = start - g_laststart;
	g_laststart = start;
	g_lastlen = end - start;
}

static inline uint32_t gets2()
{
	uint32_t ret;
	asm volatile( "mv %[ret], s2" : [ret]"=&r"(ret) );
	return ret;
}


void InnerLoop()
{
	while(1){
#if 0
		int adcz = adc_buffer[0];
		for( k = 0; k < 128; k++ )
		{
			int y = adc_buffer[k]-adcz + 64;
			if( y < 0 ) y = 0;
			if( y > 127 ) y = 127;
			ssd1306_drawPixel( k, y, 1 );
		}
#endif

		int pxa = 0;

		// Only display half of the list so the other half could
		// be updated by the ISR.
		int glread = qibaselogs_head;

		int intensity = 0;

		for( pxa = 0; pxa < LOG_GOERTZEL_LIST; pxa++ )
		{
			uint32_t combiq = qibaselogs[glread];
			glread = ( glread + 1 ) & ( LOG_GOERTZEL_LIST -1 );

			int16_t rr = combiq & 0xffff;
			int16_t ri = combiq >> 16;

			rr = rr * 512 / (intensity_average);
			ri = ri * 512 / (intensity_average);

			rr += 64;
			ri += 64;

			if( rr < 0 ) rr = 0;
			if( ri < 0 ) ri = 0;
			if( rr > 127 ) rr = 127;
			if( ri > 127 ) ri = 127;
			
#ifdef ENABLE_OLED
			ssd1306_drawPixel( rr, ri, 1 );
#endif
		}

#ifdef ENABLE_OLED
		//char cts[32];
		//snprintf( cts, 32, "%d", intensity_average );
		//ssd1306_drawstr( 0, 0, cts, 1 );

		ssd1306_refresh();
		//static int ik = 0;
		//printf( "%d %08x\n", ik, ssd1306_buffer[ik++] );
		//if( ik == sizeof(ssd1306_buffer) ) ik = 0;

		ssd1306_setbuf(0);

#else
		Delay_Ms(17);
#endif
		
//		printf( "%6d %8d %8d - %8d %8d - %8d\n", g_goertzel_outs,g_goertzelp2_store, g_goertzelp_store, rr, ri, x );

//		Delay_Ms(940);
//printf( "!!!!\n ");

	}

}

uint8_t i2c_send_buffer[16];
void setup_i2c_dma(void)
{
	// Turn on DMA
	RCC->AHBPCENR |= RCC_AHBPeriph_DMA1;

	//DMA1_Channel6 is for I2C1TX
	DMA1_Channel6->PADDR = (uint32_t)&I2C1->DATAR;
	DMA1_Channel6->MADDR = (uint32_t)&i2c_send_buffer;
	DMA1_Channel6->CNTR  = 0;
	DMA1_Channel6->CFGR  =
		DMA_M2M_Disable |		 
		DMA_Priority_Low |
		DMA_MemoryDataSize_Byte |
		DMA_PeripheralDataSize_Byte |
		DMA_MemoryInc_Enable |
		DMA_Mode_Normal |
		DMA_DIR_PeripheralDST | 
		0;
	I2C1->CTLR2 = I2C_CTLR2_DMAEN | 0b111100;

	DMA1_Channel6->CFGR |= DMA_CFGR1_EN;

	NVIC_DisableIRQ(I2C1_EV_IRQn);

	printf( "INTO\n" );
}

uint8_t ssd1306_i2c_send_turbo(uint8_t *data, uint8_t sz)
{

	int32_t timeout;
	volatile uint32_t dump = 0;
	static int notfirst = 0;

	if( notfirst == 1 )
	{
		timeout = 100;
		while((!ssd1306_i2c_chk_evt(SSD1306_I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)) && (timeout--));

		while(DMA1_Channel6->CNTR);

		// This one is reliable.
		timeout = TIMEOUT_MAX*10;
		while((!ssd1306_i2c_chk_evt(SSD1306_I2C_EVENT_MASTER_BYTE_TRANSMITTED)) && (timeout--));

		I2C1->CTLR1 |= I2C_CTLR1_STOP;
	}
		notfirst = 1;


/*
	// wait for previous packet to finish
	while(DMA1_Channel6->CNTR)
	{
		printf( "*%d / %08x %08x %08x\n", DMA1_Channel6->CNTR, DMA1_Channel6->CFGR, I2C1->CTLR1, I2C1->CTLR2 );
	}
*/
	// init buffer for sending
	memcpy((uint8_t *)i2c_send_buffer, data, sz);

	// wait for not busy
	timeout = TIMEOUT_MAX*10;
	while((I2C1->STAR2 & I2C_STAR2_BUSY) && (timeout--));
//	if(timeout==-1)
//		return ssd1306_i2c_error(0);

	DMA1_Channel6->CNTR  = sz-3;
	I2C1->CTLR1 |= I2C_CTLR1_START;

	// wait for master mode select  (This one is reliable)
	timeout = TIMEOUT_MAX*10;
	while((!ssd1306_i2c_chk_evt(SSD1306_I2C_EVENT_MASTER_MODE_SELECT)) && (timeout--));

	//printf( "%08x\n", I2C1->STAR1 | (I2C1->STAR2<<16) );

	//if(timeout==-1)
	//	return ssd1306_i2c_error(1);


	I2C1->DATAR = data[0];

	// wait for transmit condition (this seems to not be reliable)
//	printf( "W2: %d\n", timeout );
	//if(timeout==-1)
	//	return ssd1306_i2c_error(2);


//	{
//		printf( "K%d / %08x %08x %08x\n", DMA1_Channel6->CNTR, DMA1_Channel6->CFGR, I2C1->CTLR1, I2C1->CTLR2 );
//	}


	// wait for transmit condition
//	timeout = TIMEOUT_MAX;
//	while((!ssd1306_i2c_chk_evt(SSD1306_I2C_EVENT_MASTER_BYTE_TRANSMITTED)) && (timeout--));
//	printf( "TO: %d\n", timeout );
//	if(timeout==-1)
	//	return ssd1306_i2c_error(2);


	//Delay_Us(200);
#if 0
	int32_t timeout;
	
#ifdef IRQ_DIAG
	GPIOC->BSHR = (1<<(3));
#endif
	
	// error out if buffer under/overflow
	if((sz > sizeof(ssd1306_i2c_send_buffer)) || !sz)
		return 2;
	
	// wait for previous packet to finish
	while(ssd1306_i2c_irq_state);
	
#ifdef IRQ_DIAG
	GPIOC->BSHR = (1<<(16+3));
	GPIOC->BSHR = (1<<(4));
#endif
	
	// init buffer for sending
	ssd1306_i2c_send_sz = sz;
	ssd1306_i2c_send_ptr = ssd1306_i2c_send_buffer;
	memcpy((uint8_t *)ssd1306_i2c_send_buffer, data, sz);
	
	// wait for not busy
	timeout = TIMEOUT_MAX;
	while((I2C1->STAR2 & I2C_STAR2_BUSY) && (timeout--));
	if(timeout==-1)
		return ssd1306_i2c_error(0);

	// Set START condition
	I2C1->CTLR1 |= I2C_CTLR1_START;
	I2C1->DATAR = data[0];

/*
	// wait for master mode select
	timeout = TIMEOUT_MAX;
	while((!ssd1306_i2c_chk_evt(SSD1306_I2C_EVENT_MASTER_MODE_SELECT)) && (timeout--));
	if(timeout==-1)
		return ssd1306_i2c_error(1);

	// send 7-bit address + write flag
	I2C1->DATAR = data[0];

	// wait for transmit condition
	timeout = TIMEOUT_MAX;
	while((!ssd1306_i2c_chk_evt(SSD1306_I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)) && (timeout--));
	if(timeout==-1)
		return ssd1306_i2c_error(2);
*/
	// Enable TXE interrupt
	I2C1->CTLR2 |= I2C_CTLR2_ITBUFEN | I2C_CTLR2_ITEVTEN;
	ssd1306_i2c_irq_state = 1;

#ifdef IRQ_DIAG
	GPIOC->BSHR = (1<<(16+4));
#endif
	printf( "...\n" );
	// exit
	return 0;
#endif
}


int main()
{
	SystemInit();

	SysTick->CTLR = (1<<2) | 1; // HCLK
	Delay_Ms(100);

	RCC->CTLR |= RCC_HSEON;
	while( ! ( RCC->CTLR & RCC_HSERDY ) );

	RCC->CFGR0 = (RCC->CFGR0 & ~RCC_SW) | RCC_SW_HSE;

	RCC->CTLR &= ~RCC_PLLON;

	// Switch PLL to HSE.
	RCC->CFGR0 |= RCC_PLLSRC;

	// x18; 8MHz x 18 = 144 MHz
	RCC->CFGR0 &= ~RCC_PPRE2; // No divisor on APB1/2
	RCC->CFGR0 &= ~RCC_PPRE1;
	RCC->CFGR0 |= RCC_PLLMULL_0 | RCC_PLLMULL_1 | RCC_PLLMULL_2 | RCC_PLLMULL_3;

	RCC->CTLR |= RCC_PLLON;

	// Switch to PLL
	RCC->CFGR0 = (RCC->CFGR0 & ~RCC_SW) | RCC_SW_PLL;

	// Disable HSI
	RCC->CTLR &= ~(RCC_HSION);

	Delay_Ms(10);


