cnlohr/lolra/ch32v/ch32v203-goertzel/adcgoertzel.c
	//printf( "CTLR: %08x / CFGR0: %08x\n", (RCC->CTLR), (RCC->CFGR0) );
	RCC->AHBPCENR |= 3; //DMA2EN | DMA1EN
	RCC->APB2PCENR |= RCC_APB2Periph_TIM1 | RCC_APB2Periph_ADC1 | RCC_APB2Periph_ADC2 | 0x07 | RCC_APB2Periph_GPIOA; // Enable all GPIO
	RCC->APB1PCENR |= RCC_APB1Periph_TIM2;

	SetupADC();

#if defined( ENABLE_OLED )
	ssd1306_i2c_setup();
	ssd1306_i2c_init();

	if( ssd1306_init() )
		printf( "Failed to initialize OLED\n" );
	else
		printf( "Initialized OLED\n" );

	ssd1306_setbuf(1);
	ssd1306_refresh();
#endif

#ifdef ENABLE_OLED_SCOPE
	int i;

	ssd1306_spi_init();
	ssd1306_rst();

	if( ssd1306_init() )
		printf( "Failed to initialize OLED\n" );
	else
		printf( "Initialized OLED\n" );

	ssd1306_setbuf(1);
	ssd1306_refresh();

	while(1)
	{
		printf( "OK\n" );
	}
/*
	ssd1306_setbuf(0);

	// Setup a diagonal to allow for vector mode.
	for( i = 0; i < 128; i++ )
	{
		ssd1306_drawPixel( i, i, 1 );
		ssd1306_drawPixel( i+1, i, 1 );
	}

	ssd1306_refresh();

	int rframe = 0;

	uint8_t force_two_row_mode[] = {
		0x00, 0xa8, 0, // Set MUX ratio (Actually # of lines to scan) (But it's this + 1)  You can make this 1 for wider.
	};
	ssd1306_i2c_send(SSD1306_I2C_ADDR, force_two_row_mode, sizeof(force_two_row_mode));

	// Last thing before normal operation
	setup_i2c_dma();

	while(1)
	{
		// Set X, Pause, Set Y, Start
		uint8_t cmdxy[17] = { SSD1306_I2C_ADDR<<1, 0x00, 0xd3, 0x30, 0x00, 0xd5, 0xff, 0x00, 0x00, 0xdc, 0x30, 0x00, 0xd5, 0xf0 };
		cmdxy[3] = rframe;
		cmdxy[10] = rframe>>8;
		//ssd1306_i2c_send(SSD1306_I2C_ADDR, cmdxy+1, sizeof(cmdxy)-1);
		ssd1306_i2c_send_turbo(cmdxy, sizeof(cmdxy));
		rframe++;
	}
*/
#endif

#if 0
	int i = 0;
	int k = 0;
	int frame = 0;
	while( 1)
	{
//		ssd1306_drawLine( (frame)%128, (0)%128, (0)%128, (127-frame)%128, 1 );
		ssd1306_drawstr( frame%128, frame%128, "hello", 1 );

		ssd1306_refresh();
		ssd1306_setbuf(0);
		frame++;
	}

	while(1);
#endif

#if 0
	// turn on the op-amp
	EXTEN->EXTEN_CTR |= EXTEN_OPA_EN;

	// select op-amp pos pin: 0 = PA2, 1 = PD7
	EXTEN->EXTEN_CTR |= EXTEN_OPA_PSEL;

	// select op-amp neg pin: 0 = PA1, 1 = PD0
	EXTEN->EXTEN_CTR |= EXTEN_OPA_NSEL;
#endif

#ifdef PROFILING_PIN
	funPinMode( PROFILING_PIN, GPIO_CFGLR_OUT_50Mhz_PP );
#endif

	SetupTimer1();

	USBOTGSetup();


	InnerLoop();
}





uint8_t scratchpad[512];
int g_isConfigurePacket = 0;

int HandleHidUserSetReportSetup( struct _USBState * ctx, tusb_control_request_t * req )
{
	int id = req->wValue & 0xff;
	g_isConfigurePacket = 0;
	if( id == 0xaa && req->wLength <= sizeof( scratchpad ) )
	{
		ctx->pCtrlPayloadPtr = scratchpad;
		return req->wLength;
	}
	else if( id == 0xac && req->wLength <= sizeof( scratchpad ) )
	{
		g_isConfigurePacket = 1;
		ctx->pCtrlPayloadPtr = scratchpad;
		return req->wLength;
	}
	return 0;
}

int HandleHidUserGetReportSetup( struct _USBState * ctx, tusb_control_request_t * req )
{
	int id = req->wValue & 0xff;
	if( id == 0xaa )
	{
		ctx->pCtrlPayloadPtr = scratchpad;
		return 255;
	}
	else if( id == 0xac )
	{
		g_isConfigurePacket = 1;
		ctx->pCtrlPayloadPtr = scratchpad;
		return 63;
	}
	else if( id == 0xad )
	{
		static int last_baselog;

		int samps_to_send = (qibaselogs_head - last_baselog + LOG_GOERTZEL_LIST * 2 - 1) & (LOG_GOERTZEL_LIST-1);
		if( samps_to_send > 120 ) samps_to_send = 120;

		((uint32_t*)scratchpad)[0] = (intensity_average<<12) | samps_to_send;
		((uint32_t*)scratchpad)[1] = (g_lastper<<16) | g_lastlen;
		((uint32_t*)scratchpad)[2] = (0<<16) | (((g_pwm_period+1)*g_goertzel_buffer)); //LSW = 144MHz / X

		int i;
		for( i = 3; i < samps_to_send + 3; i++ )
		{
			last_baselog = (last_baselog+1)&(LOG_GOERTZEL_LIST-1);
			((uint32_t*)(scratchpad))[i] = ((int32_t*)qibaselogs)[last_baselog];
		}

		for( ; i < 128; i++ )
			((uint32_t*)(scratchpad))[i]  = 0;
			

		ctx->pCtrlPayloadPtr = scratchpad;
		return 510;
	}
	return 0;
}

void HandleHidUserReportDataOut( struct _USBState * ctx, uint8_t * data, int len )
{
}

int HandleHidUserReportDataIn( struct _USBState * ctx, uint8_t * data, int len )
{
//	printf( "IN %d %d %08x %08x\n", len, ctx->USBFS_SetupReqLen, data, FSUSBCTX.ENDPOINTS[0] );
//	memset( data, 0xcc, len );
	return len;
}

void HandleHidUserReportOutComplete( struct _USBState * ctx )
{
	if( g_isConfigurePacket )
	{

		uint32_t * configs = (uint32_t*)scratchpad;
		// Note: configs[0] == 0xac (command type)

		printf( "Is Configure Packet %08x\n", configs[1] );

		int numconfigs = configs[1];
		if( numconfigs > 0) g_pwm_period = configs[2];
		if( numconfigs > 1) g_goertzel_buffer = configs[3];
		if( numconfigs > 2) g_goertzel_omega_per_sample = configs[4]; // 0.816667 of whole per step / 0.880000MHz
		if( numconfigs > 3) g_goertzel_coefficient = configs[5];
		if( numconfigs > 4) g_goertzel_coefficient_s = configs[6];
		if( numconfigs > 5) g_exactcompute = configs[7];
		if( numconfigs > 6) g_goertzel_advance_r = configs[8];
		if( numconfigs > 7) g_goertzel_advance_i = configs[9];
		if( numconfigs > 8) 
		{
			int adc_buffer = configs[10];
			if( adc_buffer )
			{
				// Consider using PGA.
				//ADC_Pga_16 | ADC_SCAN | ADC_BUFEN ;
				//ADC_Pga_64 | ADC_SCAN;
				ADC1->CTLR1 = 
					ADC_SCAN | ADC_BUFEN;
			}
			else
			{
				ADC1->CTLR1 = 
					ADC_SCAN;
			}
		}

		// Need to reset so we don't blast by.
		g_goertzel_samples = 0;
		TIM1->ATRLR = g_pwm_period;

		g_isConfigurePacket = 0;
	}
	return;
}

